cf_billing/InformationRegisters/бестПриборыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриборыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестАктивностьТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестАктивностьТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоМесяцамЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоМесяцамЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСостояниеПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСостояниеПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестУслугиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУслугиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПриборовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ввод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вывод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПоверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/бестИнтеграции/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РегламентноеЗадание

// Загрузить показания из пирамиды.
//
// Параметры:
//  КаталогФайлов	-	ХранилищеЗначения.
//
Процедура ЗагрузитьПоказанияИзПирамиды(КаталогФайлов = Неопределено) Экспорт
	Если КаталогФайлов = Неопределено Тогда
		КаталогФайлов		= ДанныеНастроек();
	КонецЕсли;
	
	Если ПустаяСтрока(КаталогФайлов) Тогда
		Возврат;
	КонецЕсли;	
	
	ФайлыДляЗагрузки	= ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогФайлов, ПрефиксЗагруженногоФайла());
	
	Если ФайлыДляЗагрузки.Количество() = 0 Тогда
		ЗафиксироватьОтсутствиеФайлаЗагрузки("Загрузить показания из АСКУЭ Пирамида (ЮЛ)");
		Возврат;
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	Для Каждого ТекФайл Из ФайлыДляЗагрузки Цикл				
		АдресХранилища = УпаковатьВоВременноеХранилище(ТекФайл.ПолноеИмя, УникальныйИдентификатор);
		НачатьТранзакцию(); 		
		Попытка
			
			ЗагрузитьПоказанияИзРегламентногоЗадания(АдресХранилища, ТекФайл.ПолноеИмя);
			
			УстановитьПрефиксЗагруженногоФайла(ТекФайл);			
			
			ЗафиксироватьТранзакцию();		
		Исключение
			ОтменитьТранзакцию();
			
			ОписаниеОшибки 	= ИнформацияОбОшибке();
			ДопИнформация 	= "Путь к файлу: " + ТекФайл.ПолноеИмя;
			ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников("Загрузить показания из АСКУЭ Пирамида (ЮЛ)", ОписаниеОшибки, ДопИнформация);
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

#Область РаботаСНастройкамиОбмена

// Получение константы энргНастройкаИнтеграцииСПирамидой.
// 
// Возвращаемое значение:
//  ХранилищеЗначения - константа энргНастройкаИнтеграцииСПирамидой.
//
Функция ОбъектНастроекОбмена() Экспорт 
	Возврат Константы.энргНастройкаИнтеграцииСПирамидой;
КонецФункции

// Значение константы энргНастройкаИнтеграцииСПирамидой.
// 
// Возвращаемое значение:
//  ХранилищеЗначения - значение константы энргНастройкаИнтеграцииСПирамидой.
//
Функция ДанныеНастроек() Экспорт 
	ОбъектНастроекОбмена 	= ОбъектНастроекОбмена();
	ДанныеНастроек 			= ОбъектНастроекОбмена.Получить();
	
	Возврат ДанныеНастроек.Получить();
КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// Префикс загруженного файла.
// 
// Возвращаемое значение:
//  Строка	-	префикс загруженного файла.
//
Функция ПрефиксЗагруженногоФайла() Экспорт 
	Возврат "Загружен_";
КонецФункции

// Получить файлы для загрузки из каталога.
//
// Параметры:
//  КаталогПоиска				-	Строка	-	путь к файлу.
//  ПрефиксЗагруженногоФайла	-	Строка	-	префикс загруженного файла.
//  Маска						-	Строка	-	маска поиска.
// 
// Возвращаемое значение:
//  Массив.
//
Функция ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогПоиска, ПрефиксЗагруженногоФайла, Маска = "*.xml") Экспорт 
	Ответ = Новый Массив;
	
	НайденныеФайлы = НайтиФайлы(КаталогПоиска, Маска);
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		Если СтрНайти(ТекФайл.ИмяБезРасширения, ПрефиксЗагруженногоФайла) > 0 Тогда
			Продолжить;	
		КонецЕсли; 
		
		Ответ.Добавить(ТекФайл);
	КонецЦикла; 	
	
	Возврат Ответ;
КонецФункции

// Получить имя файла после загрузки.
//
// Параметры:
//  ПолныйПуть	-	Строка	-	полный путь к файлу.
// 
// Возвращаемое значение:
//  Строка	-	имя файла после загрузки.
//
Функция ПолучитьИмяФайлаПослеЗагрузки(ПолныйПуть) Экспорт 
	Результат	= ПолныйПуть;
	
	Файл 		= Новый Файл(ПолныйПуть);	
	Если НЕ Файл.Существует() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Результат			= СтрЗаменить(ПолныйПуть, "\" + ИмяБезРасширения, "\" + ПрефиксЗагруженногоФайла() + ИмяБезРасширения);
	Возврат Результат;	
КонецФункции

// Установить префикс загруженного файла.
//
// Параметры:
//  ТекФайл		-	Файл	-	загруженный файл.
// 
// Возвращаемое значение:
//  НовоеИмяФайла	-	Строка	-	имя файла после загрузки.
//
Функция УстановитьПрефиксЗагруженногоФайла(ТекФайл) Экспорт
	НовоеИмяФайла = ПолучитьИмяФайлаПослеЗагрузки(ТекФайл.ПолноеИмя);
	ПереместитьФайл(ТекФайл.ПолноеИмя, НовоеИмяФайла);
	
	Возврат НовоеИмяФайла;
КонецФункции

#КонецОбласти

#КонецОбласти

// Загружает данные почасовой ведомости.
//
// Параметры:
//  ПараметрыДокумента		-	ДанныеФормыСтруктура.
//  ЗаводскойНомер			-	Число.
//  КодТУ					-	Число.
//  ПредоставленныеОбъемы	-	ТаблицаЗначений.
// 
// Возвращаемое значение:
//   ДокументСсылка.бестЗагруженныеДанныеИзВнешнихИсточников.
//
Функция ЗагрузитьДанныеПочасовойВедомости(ПараметрыДокумента, ЗаводскойНомер, КодТУ, ПредоставленныеОбъемы) Экспорт
	НачатьТранзакцию();
	ФайлДляЧтения = ПараметрыДокумента.ФайлДляЧтения;
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргТочкиУчета.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТУ
		|ИЗ
		|	Справочник.энргТочкиУчета КАК энргТочкиУчета
		|ГДЕ
		|	энргТочкиУчета.Код = &КодТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргПриборыУчетаАбонента.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПУ
		|ИЗ
		|	Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
		|ГДЕ
		|	энргПриборыУчетаАбонента.Код = &ЗаводскойНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестПриборыТочекУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестПриборыТочекУчетаНПСрезПоследних.Район КАК Район,
		|	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК Ссылка
		|ПОМЕСТИТЬ ПУТочекУчета
		|ИЗ
		|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
		|			,
		|			ПриборУчета В
		|				(ВЫБРАТЬ
		|					ПУ.Ссылка КАК ПриборУчета
		|				ИЗ
		|					ПУ КАК ПУ)) КАК бестПриборыТочекУчетаНПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестАктивностьТочекУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестАктивностьТочекУчетаНПСрезПоследних.Район КАК Район,
		|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
		|	бестОбъектыРасчета.МКД КАК МКД,
		|	ПУТочекУчета.Ссылка КАК ПриборУчета
		|ИЗ
		|	ТУ КАК ТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(, ) КАК бестАктивностьТочекУчетаНПСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
		|			ПО бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПУТочекУчета КАК ПУТочекУчета
		|			ПО бестАктивностьТочекУчетаНПСрезПоследних.Организация = ПУТочекУчета.Организация
		|				И бестАктивностьТочекУчетаНПСрезПоследних.Район = ПУТочекУчета.Район
		|				И бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = ПУТочекУчета.ОбъектРасчета
		|				И бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета = ПУТочекУчета.ТочкаУчета
		|		ПО ТУ.Ссылка = бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
		|ГДЕ
		|	НЕ бестЗагруженныеДанныеИзВнешнихИсточников.ПометкаУдаления
		|	И бестЗагруженныеДанныеИзВнешнихИсточников.Дата = &Дата
		|	И бестЗагруженныеДанныеИзВнешнихИсточников.ФайлДляЧтения = &ФайлДляЧтения";
		
		Запрос.УстановитьПараметр("ЗаводскойНомер", ЗаводскойНомер);
		Запрос.УстановитьПараметр("КодТУ", 			КодТУ);
		Запрос.УстановитьПараметр("Дата", 			ПараметрыДокумента.Дата);
		Запрос.УстановитьПараметр("ФайлДляЧтения", 	ФайлДляЧтения);
		
		
		Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		ВыборкаТУ 					= Пакет[0].Выбрать();
		ВыборкаПУ 					= Пакет[2].Выбрать();
		ВыборкаИтог 				= Пакет[3].Выбрать();
		ВыборкаЗагруженныеДанные 	= Пакет[4].Выбрать();
		
		
		Если ВыборкаЗагруженныеДанные.Следующий() Тогда
			ДокЗагруженныеДанные 				= ВыборкаЗагруженныеДанные.Ссылка.ПолучитьОбъект();
			ДокЗагруженныеДанные.ЗагруженныеДанные.Очистить();
			ДокЗагруженныеДанные.ПредоставленныеОбъемы.Очистить();
		Иначе
			ДокЗагруженныеДанные 				= Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьДокумент();
		КонецЕсли;  
		
		ЗаполнитьЗначенияСвойств(ДокЗагруженныеДанные, ПараметрыДокумента);

		СтрЗагруженныеДанные 							= ДокЗагруженныеДанные.ЗагруженныеДанные.Добавить();
		IDСтроки					            		= Новый УникальныйИдентификатор;
		СтрЗагруженныеДанные.IDСтроки 					= IDСтроки;
		СтрЗагруженныеДанные.ВидОперации 				= ПараметрыДокумента.ВидОперации;
		СтрЗагруженныеДанные.УчитыватьКоэффициентПУ     = ПараметрыДокумента.УчитыватьКоэффициентПУ;
		
		Если ВыборкаИтог.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтрЗагруженныеДанные, ВыборкаИтог);
			СтрЗагруженныеДанные.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыДокумента.Дата, ВыборкаИтог.Организация,ВыборкаИтог.Район);
			СтрЗагруженныеДанные.ГотовКОбработке = Истина;
		Иначе
			
			СтрЗагруженныеДанные.ГотовКОбработке = Ложь;
			
			Если ВыборкаТУ.Следующий() Тогда
				СтрЗагруженныеДанные.ТочкаУчетаИзФайла 		= ВыборкаТУ.Ссылка;
				СтрЗагруженныеДанные.ТочкаУчета 			= ВыборкаТУ.Ссылка;
			Иначе
				СтрЗагруженныеДанные.ТочкаУчетаИзФайла 		= КодТУ;
			КонецЕсли;
			
			Если ВыборкаПУ.Следующий() Тогда
				СтрЗагруженныеДанные.ПриборУчетаИзФайла 	= ВыборкаПУ.Ссылка;
				СтрЗагруженныеДанные.ПриборУчета 			= ВыборкаПУ.Ссылка;
			Иначе
				СтрЗагруженныеДанные.ПриборУчетаИзФайла 	= ЗаводскойНомер;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Для каждого стр из ПредоставленныеОбъемы Цикл
			СтрПредоставленныеОбъемы = ДокЗагруженныеДанные.ПредоставленныеОбъемы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПредоставленныеОбъемы, стр);
			СтрПредоставленныеОбъемы.IDСтроки = IDСтроки;
		КонецЦикла;
		
		ДозаполнитьОтсутствующиеОбъемы(СтрЗагруженныеДанные, ДокЗагруженныеДанные, IDСтроки);
		
		ДокЗагруженныеДанные.ДополнительныеСвойства.Вставить("МассоваяЗагрузка", Истина);
		ДокЗагруженныеДанные.Записать();
		ЗафиксироватьТранзакцию();
		Возврат ДокЗагруженныеДанные.Ссылка;
					
	Исключение
		ОтменитьТранзакцию();
		
		ОписаниеОшибки 	= ИнформацияОбОшибке();
		ДопИнформация 	= "Путь к файлу: " + ФайлДляЧтения;
		ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников("Загрузить показания из АСКУЭ Пирамида (ЮЛ)", ОписаниеОшибки, ДопИнформация);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции	

#Область ЗагрузкаОплат

// Загружает файл оплаты регламентное задание.
//
// Параметры:
//  КаталогФайлов	-	Строка.
//
Процедура ЗагрузитьФайлОплатыРегламентноеЗадание(КаталогФайлов = Неопределено) Экспорт
	Если КаталогФайлов = Неопределено Тогда
		КаталогФайлов		= энргОбщегоНазначения.ЗначениеКонстанты("бестКаталогЗагрузкиОплаты");
	КонецЕсли;
	
	Если ПустаяСтрока(КаталогФайлов) Тогда
		Возврат;
	КонецЕсли;	
	
	
	ФайлыДляЗагрузки	= ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогФайлов, ПрефиксЗагруженногоФайла(),"*.TXT");
	
	Если ФайлыДляЗагрузки.Количество() = 0 Тогда
		ЗафиксироватьОтсутствиеФайлаЗагрузки("Загрузить оплату TXT");
		Возврат;
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	Для Каждого ТекФайл Из ФайлыДляЗагрузки Цикл				
		АдресХранилища = УпаковатьВоВременноеХранилище(ТекФайл.ПолноеИмя, УникальныйИдентификатор);
		НачатьТранзакцию(); 		
		Попытка
			
			ЗагрузитьФайлОплаты(АдресХранилища);
			
			УстановитьПрефиксЗагруженногоФайла(ТекФайл);			
			
			ЗафиксироватьТранзакцию();		
		Исключение
			ОтменитьТранзакцию();
			
			ОписаниеОшибки 	= ИнформацияОбОшибке();
			ДопИнформация 	= "Путь к файлу: " + ТекФайл.ПолноеИмя;
			ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников("Загрузить оплату TXT", ОписаниеОшибки, ДопИнформация);
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

// Загружает файл оплаты.
//
// Параметры:
//  АдресХранилища	-	Строка.
//  ДокументОбъект	-	ДанныеФормыСтруктура.
//
Процедура ЗагрузитьФайлОплаты(АдресХранилища, ДокументОбъект = Неопределено) Экспорт
	ОсновнаяОрганизация = Справочники.Организации.НашаОрганизация;
	ЗаписатьДокумент 	= Ложь;
	
	Если ДокументОбъект = Неопределено Тогда
		 ЗаписатьДокумент = Истина;
		 ДокументОбъект 			= Документы.бестПлатежноеПоручениеВходящееЭЭЮрЛица.СоздатьДокумент();
		 ДокументОбъект.Дата 		= ТекущаяДата();
		 ДокументОбъект.Организация = ОсновнаяОрганизация;
	КонецЕсли;
	
	ТЗ_ПолученныеДанные = Новый ТаблицаЗначений;
	ТЗ_ПолученныеДанные.Колонки.Добавить("ПлательщикИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("ПолучательИНН", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("Получатель", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("Плательщик", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", ,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТЗ_ПолученныеДанные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,2)));
	
	мСтроковыеДанные = Новый Массив;
	мСтроковыеДанные.Добавить("ПлательщикИНН=");
	мСтроковыеДанные.Добавить("ПолучательИНН=");
	мСтроковыеДанные.Добавить("Получатель=");
	мСтроковыеДанные.Добавить("Плательщик=");
	мСтроковыеДанные.Добавить("НазначениеПлатежа=");
	мСтроковыеДанные.Добавить("Номер=");
	
	мЧисловыеДанные = Новый Массив;
	мСтроковыеДанные.Добавить("Сумма=");
	
	мДатаДанные = Новый Массив;
	мДатаДанные.Добавить("Дата=");
	
	ФайлЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилища);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ФайлЗагрузки.ОткрытьПотокДляЧтения());  
	МассивСтрок = СтрРазделить(ТекстДок.ПолучитьТекст(),Символы.ПС);
	
	НовСтр = Неопределено;
	
	Для каждого Строка Из МассивСтрок Цикл
		Найден = Ложь;
		
		Если Найти(Строка, "СекцияДокумент") Тогда
			НовСтр = ТЗ_ПолученныеДанные.Добавить();
			Продолжить;
		КонецЕсли;
		
		Если НовСтр <> Неопределено Тогда
			Для каждого эл из мСтроковыеДанные Цикл
				Если Найти(Строка, эл) Тогда
					НовСтр[СтрЗаменить(эл,"=","")] = СтрЗаменить(Строка,эл,"");
					Найден = Истина;
				КонецЕсли; 
			КонецЦикла;
			
			Если Найден Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого эл из мЧисловыеДанные Цикл
				Если Найти(Строка, эл) Тогда
					НовСтр[СтрЗаменить(эл,"=","")] = Число(СтрЗаменить(Строка,эл,""));
					Найден = Истина;
				КонецЕсли; 
			КонецЦикла;
			
			Если Найден Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого эл из мДатаДанные Цикл                                                     
				Если СтрНачинаетсяС(Строка, эл) Тогда
					НовСтр[СтрЗаменить(эл,"=","")] = СтроковыеФункцииКлиентСервер.СтрокаВДату(СокрЛП(СтрЗаменить(Строка,эл,"")));
					Найден = Истина;
				КонецЕсли; 
			КонецЦикла;
			
			Если Найден Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.НеЗагруженныеДанные.Очистить();
	ДокументОбъект.Оплата.Очистить();
	ДокументОбъект.ДокументыНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.ПлательщикИНН КАК ПлательщикИНН,
	|	ТЗ.ПолучательИНН КАК ПолучательИНН,
	|	ТЗ.Получатель КАК Получатель,
	|	ТЗ.Плательщик КАК Плательщик,
	|	ТЗ.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТЗ.Номер КАК Номер,
	|	ТЗ.Сумма КАК Сумма,
	|	ТЗ.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЗ.ПлательщикИНН КАК ПлательщикИНН,
	|	ВТ_ТЗ.ПолучательИНН КАК ПолучательИНН,
	|	ВТ_ТЗ.Получатель КАК Получатель,
	|	ВТ_ТЗ.Плательщик КАК Плательщик,
	|	ВТ_ТЗ.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_ТЗ.Номер КАК Номер,
	|	ВТ_ТЗ.Сумма КАК Сумма,
	|	ВТ_ТЗ.Дата КАК Дата,
	|	ЕСТЬNULL(Организации.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)) КАК ОрганизацияПолучательСсылка,
	|	ЕСТЬNULL(энргКонтрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.Пустаяссылка)) КАК КонтрагентСсылка,
	|	ЕСТЬNULL(Организации1.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)) КАК ОрганизацияПлательщикСсылка
	|ПОМЕСТИТЬ ВТ_Контрагент
	|ИЗ
	|	ВТ_ТЗ КАК ВТ_ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТ_ТЗ.ПолучательИНН = Организации.ИНН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ПО ВТ_ТЗ.ПлательщикИНН = энргКонтрагенты.ИНН
	|			И (НЕ ВТ_ТЗ.ПлательщикИНН = """")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации1
	|		ПО ВТ_ТЗ.ПлательщикИНН = Организации1.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Получатель КАК Получатель,
	|	Итог.Плательщик КАК Плательщик,
	|	Итог.НазначениеПлатежа КАК НазначениеПлатежа,
	|	Итог.Номер КАК НомерПлатежногоДокумента,
	|	Итог.Сумма КАК СуммаОплаты,
	|	Итог.Дата КАК ДатаПлатежногоДокумента,
	|	Итог.КонтрагентСсылка КАК Контрагент,
	|	Итог.ОрганизацияПолучательСсылка КАК Организация,
	|	Итог.ПлательщикИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_КонтрагентИтог
	|ИЗ
	|	ВТ_Контрагент КАК Итог
	|ГДЕ
	|	Итог.ОрганизацияПлательщикСсылка <> &ОсновнаяОрганизация
	|	И (Итог.ОрганизацияПолучательСсылка = &ОсновнаяОрганизация
	|			ИЛИ Итог.ОрганизацияПолучательСсылка = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(энргДоговорыКонтрагентов.Ссылка, ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка))) КАК КолвоДоговоров,
	|	МАКСИМУМ(ЕСТЬNULL(энргДоговорыКонтрагентов.Ссылка, ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка))) КАК Договор,
	|	ВТ_КонтрагентИтог.Получатель КАК Получатель,
	|	ВТ_КонтрагентИтог.Плательщик КАК Плательщик,
	|	ВТ_КонтрагентИтог.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_КонтрагентИтог.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	|	ВТ_КонтрагентИтог.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_КонтрагентИтог.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ВТ_КонтрагентИтог.Контрагент КАК Контрагент,
	|	ВТ_КонтрагентИтог.Организация КАК Организация,
	|	ВТ_КонтрагентИтог.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_Договор
	|ИЗ
	|	ВТ_КонтрагентИтог КАК ВТ_КонтрагентИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО (ВТ_КонтрагентИтог.Контрагент <> ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.Пустаяссылка))
	|			И (НЕ энргДоговорыКонтрагентов.ПометкаУдаления)
	|			И (энргДоговорыКонтрагентов.ОснованиеДопСоглашения = ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.Пустаяссылка))
	|			И ВТ_КонтрагентИтог.Контрагент = энргДоговорыКонтрагентов.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КонтрагентИтог.Получатель,
	|	ВТ_КонтрагентИтог.Плательщик,
	|	ВТ_КонтрагентИтог.НазначениеПлатежа,
	|	ВТ_КонтрагентИтог.НомерПлатежногоДокумента,
	|	ВТ_КонтрагентИтог.СуммаОплаты,
	|	ВТ_КонтрагентИтог.ДатаПлатежногоДокумента,
	|	ВТ_КонтрагентИтог.Контрагент,
	|	ВТ_КонтрагентИтог.Организация,
	|	ВТ_КонтрагентИтог.ИНН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_Договор.КолвоДоговоров = 1
	|			ТОГДА ВТ_Договор.Договор
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргдоговорыконтрагентов.пустаяссылка)
	|	КОНЕЦ КАК Договор,
	|	ВТ_Договор.Получатель КАК Получатель,
	|	ВТ_Договор.Плательщик КАК Плательщик,
	|	ВТ_Договор.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_Договор.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	|	ВТ_Договор.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_Договор.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ВТ_Договор.Контрагент КАК Контрагент,
	|	ВТ_Договор.Организация КАК Организация,
	|	ВТ_Договор.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_ОдинДоговор
	|ИЗ
	|	ВТ_Договор КАК ВТ_Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестВзаиморасчетыПоМесяцамЭЭОстатки.Договор КАК Договор,
	|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПериодНачисления КАК ПериодНачисления,
	|	бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_Задолженность
	|ИЗ
	|	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
	|			,
	|			Договор <> ЗНАЧЕНИЕ(Справочник.энргДоговорыКонтрагентов.пустаяссылка)
	|				И Договор В
	|					(ВЫБРАТЬ
	|						ВТ_ОдинДоговор.Договор КАК Договор
	|					ИЗ
	|						ВТ_ОдинДоговор КАК ВТ_ОдинДоговор)) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженность.Договор КАК Договор,
	|	ВТ_Задолженность.СуммаОстаток КАК СуммаОстаток,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Задолженность.ПлатежныйДокумент) КАК КолвоПД
	|ПОМЕСТИТЬ ВТ_КолвоПД
	|ИЗ
	|	ВТ_Задолженность КАК ВТ_Задолженность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Задолженность.Договор,
	|	ВТ_Задолженность.СуммаОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженность.Договор КАК Договор,
	|	ВТ_Задолженность.ПериодНачисления КАК ПериодНачисления,
	|	ВТ_Задолженность.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВТ_Задолженность.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ЗадолженностьИтог
	|ИЗ
	|	ВТ_Задолженность КАК ВТ_Задолженность
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КолвоПД КАК ВТ_КолвоПД
	|		ПО ВТ_Задолженность.Договор = ВТ_КолвоПД.Договор
	|			И ВТ_Задолженность.СуммаОстаток = ВТ_КолвоПД.СуммаОстаток
	|ГДЕ
	|	ВТ_КолвоПД.КолвоПД = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОдинДоговор.Договор КАК Договор,
	|	ВТ_ОдинДоговор.Получатель КАК Получатель,
	|	ВТ_ОдинДоговор.Плательщик КАК Плательщик,
	|	ВТ_ОдинДоговор.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_ОдинДоговор.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
	|	ВТ_ОдинДоговор.СуммаОплаты КАК СуммаОплаты,
	|	ВТ_ОдинДоговор.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
	|	ВТ_ОдинДоговор.Контрагент КАК Контрагент,
	|	ВТ_ОдинДоговор.Организация КАК Организация,
	|	ЕСТЬNULL(ВТ_ЗадолженностьИтог.ПериодНачисления, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодНачисления,
	|	ЕСТЬNULL(ВТ_ЗадолженностьИтог.ПлатежныйДокумент, ЗНАЧЕНИЕ(Документ.бестПлатежныйДокумент.пустаяссылка)) КАК ДокументНачисления,
	|	ВТ_ОдинДоговор.ИНН КАК ИНН
	|ИЗ
	|	ВТ_ОдинДоговор КАК ВТ_ОдинДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностьИтог КАК ВТ_ЗадолженностьИтог
	|		ПО ВТ_ОдинДоговор.Договор = ВТ_ЗадолженностьИтог.Договор
	|			И ВТ_ОдинДоговор.СуммаОплаты = ВТ_ЗадолженностьИтог.СуммаОстаток";
	
	Запрос.УстановитьПараметр("ТЗ", 					ТЗ_ПолученныеДанные);
	Запрос.УстановитьПараметр("ОсновнаяОрганизация", 	ОсновнаяОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивПД = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Контрагент) И ЗначениеЗаполнено(Выборка.Организация) Тогда
			НовСтр = ДокументОбъект.Оплата.Добавить();
			Если ЗначениеЗаполнено(Выборка.ДокументНачисления) 
					И МассивПД.Найти(Выборка.ДокументНачисления) = Неопределено Тогда
				НовСтр.IDСтроки = Новый УникальныйИдентификатор;
				НовСтрНазначение = ДокументОбъект.ДокументыНачисления.Добавить();
				НовСтрНазначение.IDСтроки = НовСтр.IDСтроки;
				ЗаполнитьЗначенияСвойств(НовСтрНазначение, Выборка);
				МассивПД.Добавить(Выборка.ДокументНачисления);
			КонецЕсли;
		Иначе
			НовСтр = ДокументОбъект.НеЗагруженныеДанные.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
	
	Если ЗаписатьДокумент Тогда
		ДокументОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Фиксирует отсутствие файла загрузки.
//
// Параметры:
//  ИмяЗадания	-	Строка.
//
Процедура ЗафиксироватьОтсутствиеФайлаЗагрузки(ИмяЗадания) Экспорт	
	Комментарий 			= "Не найден файл в каталоге для загрузки";
	ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
КонецПроцедуры

// Фиксирует ошибки записи объекта регистрации показаний из внешних источников.
//
// Параметры:
//  ИмяЗадания		-	Строка.
//  ОписаниеОшибки	-	ИнформацияОбОшибке.
//  ДопИнформация	-	Строка.
//
Процедура ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников(ИмяЗадания, ОписаниеОшибки, ДопИнформация) Экспорт
	Комментарий 			= "Не удалось загрузить файл. " + ДопИнформация + " по причине: " + ПодробноеПредставлениеОшибки(ОписаниеОшибки);
	ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
КонецПроцедуры

// Загружает показания из регламентного задания.
//
// Параметры:
//  АдресВХ		-	Строка.
//  ИмяФайла	-	Строка
//
Процедура ЗагрузитьПоказанияИзРегламентногоЗадания(АдресВХ, ИмяФайла) Экспорт	
	ТаблицаДанных 			= ДесериализоватьФайл(АдресВХ);
	Запрос = Новый Запрос;
	Запрос.Текст 			= ПолучитьТекстЗапросаЗагрузкаДанных();
	
	
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.УстановитьПараметр("ФайлДляЧтения", ИмяФайла);
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	РезультатЗапросаДанные	 			= Пакет[Пакет.Количество() - 2];
	РезультатЗапросаДокумент 			= Пакет[Пакет.Количество() - 1];
	
	
	ДокументОб 		= Неопределено;	
	ВыборкаДокумент = РезультатЗапросаДокумент.Выбрать();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		ДокументОб =  ВыборкаДокумент.УжеСозданныйДокумент.ПолучитьОбъект();
		ДокументОб.ЗагруженныеДанные.Очистить();
		ДокументОб.ПредоставленныеОбъемы.Очистить();
		ДокументОб.Показания.Очистить();
	КонецЦикла;
	
	Если ДокументОб = Неопределено Тогда
		ДокументОб 					= Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьДокумент();
		ДокументОб.Дата 			= ТекущаяДатаСеанса();
		ДокументОб.ФайлДляЧтения 	= ИмяФайла;
	КонецЕсли;
	
	ВыборкаПриборУчета = РезультатЗапросаДанные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПриборУчета.Следующий() Цикл
		ВыборкаПочасовыеДанные = ВыборкаПриборУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПочасовыеДанные.Следующий() Цикл
			
			Если  ВыборкаПочасовыеДанные.ПочасовыеДанные Тогда
				
				IDСтрПУ = Новый УникальныйИдентификатор;
				СтрПУ = ДокументОб.ЗагруженныеДанные.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрПУ, ВыборкаПриборУчета);
				Если ЗначениеЗаполнено(ВыборкаПриборУчета.Организация) И ЗначениеЗаполнено(ВыборкаПриборУчета.Район) Тогда
					СтрПУ.ПериодНачисления 	= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДокументОб.Дата, ВыборкаПриборУчета.Организация,ВыборкаПриборУчета.Район);
				КонецЕсли;
				СтрПУ.IDСтроки 			= IDСтрПУ;
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = ВыборкаПочасовыеДанные.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.ПочасовыеДанные Тогда 
					НовСтрОбъемы = ДокументОб.ПредоставленныеОбъемы.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрОбъемы, ВыборкаДетальныеЗаписи);
					НовСтрОбъемы.IDСтроки = IDСтрПУ;
				Иначе
					СтрПУ 	= ДокументОб.Показания.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрПУ, ВыборкаДетальныеЗаписи);
					Если ЗначениеЗаполнено(ВыборкаПриборУчета.Организация) И ЗначениеЗаполнено(ВыборкаПриборУчета.Район) Тогда
						СтрПУ.ПериодНачисления 	= Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДокументОб.Дата, ВыборкаДетальныеЗаписи.Организация,ВыборкаДетальныеЗаписи.Район);
					КонецЕсли;
					СтрПУ.Шкала  	= Справочники.энргШкалыПриборовУчета.Основная;
					СтрПУ.Показания = ВыборкаДетальныеЗаписи.Объем;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
		
	Если ДокументОб <> Неопределено Тогда
		ДокументОб.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры

#Область ДесериализацияДанных

// Десериализует файл.
//
// Параметры:
//  АдресВХ	-	Строка.
// 
// Возвращаемое значение:
//   ТаблицаЗначений.
//
Функция ДесериализоватьФайл(АдресВХ) Экспорт 
	ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(АдресВХ); 	
	тПуть 			= ПолучитьИмяВременногоФайла("xml"); 
	ДвоичныеДанные.Записать(тПуть);
	
	Парсер = Новый ЧтениеXML;
	Парсер.ОткрытьФайл(тПуть);
	
	Построитель 	= Новый ПостроительDOM; 
	ДанныеФайла 	= Построитель.Прочитать(Парсер); 	
	ТаблицаДанных 	= НоваяТаблицаДесериализированныхДанных();
	
	СписокЗаводскихНомеров = ДанныеФайла.ПервыйДочерний.ПервыйДочерний.ДочерниеУзлы;
	
	Для Каждого ЭлементСекции из СписокЗаводскихНомеров Цикл
		
		ЕстьРазбивкаТЗ  = Ложь;
		
		Если ЭлементСекции.ИмяУзла = "element" и ЭлементСекции.Атрибуты.ПолучитьИменованныйЭлемент("measuringtype").Значение = "0" Тогда
			
			СекцияЗаводскойНомерПУ 	= ЭлементСекции.Атрибуты.ПолучитьИменованныйЭлемент("serial");
			
			ЗаводскойНомер			= СекцияЗаводскойНомерПУ.Значение;
			
			ВспомогательныеПараметры = Новый Структура("ПриборУчета, Показания, Дата" , ЗаводскойНомер);
			
			СписокПочасоваяВедомость 		= СекцияЗаводскойНомерПУ.ЭлементВладелец.ДочерниеУзлы;
			
			Для Каждого ЭлементСекцииТарифныхЗон из СписокПочасоваяВедомость Цикл
				АтрибутCode = ЭлементСекцииТарифныхЗон.Атрибуты.ПолучитьИменованныйЭлемент("code");
				
				Если АтрибутCode.Значение = "18" Тогда
					СписокПоказаний = АтрибутCode.ЭлементВладелец.ДочерниеУзлы;
					
					Для каждого СтрПоказаний из СписокПоказаний Цикл
						Атрибутtime = СтрПоказаний.Атрибуты.ПолучитьИменованныйЭлемент("time");
						ВспомогательныеПараметры = Новый Структура("ПриборУчета, Показания, Дата, ПочасовыеДанные" , ЗаводскойНомер, Число(СтрПоказаний.ТекстовоеСодержимое), Дата(Атрибутtime.Значение)-1, Истина);
						ДобавитьСтрокуВТаблицуДанных(ТаблицаДанных, ВспомогательныеПараметры);
					КонецЦикла;
				КонецЕсли;
				
				Если АтрибутCode.Значение = "101" Тогда
					ЕстьРазбивкаТЗ = Истина;
				КонецЕсли;
				
				Если АтрибутCode.Значение = "2021" ИЛИ АтрибутCode.Значение = "2022" Тогда
					СписокПоказаний = АтрибутCode.ЭлементВладелец.ДочерниеУзлы;
					
					Если ЕстьРазбивкаТЗ И АтрибутCode.Значение = "2021" Тогда
						ТЗ = Справочники.энргТарифныеЗоны.День;
					ИначеЕсли НЕ ЕстьРазбивкаТЗ И АтрибутCode.Значение = "2021" Тогда
						ТЗ = Справочники.энргТарифныеЗоны.БезРазбивки;
					Иначе 
						ТЗ = Справочники.энргТарифныеЗоны.Ночь;
					КонецЕсли;
					
					Для каждого СтрПоказаний из СписокПоказаний Цикл
						Атрибутtime = СтрПоказаний.Атрибуты.ПолучитьИменованныйЭлемент("time");
						ВспомогательныеПараметры = Новый Структура("ПриборУчета, Показания, Дата, ПочасовыеДанные, ТарифнаяЗона" 
						, ЗаводскойНомер, Число(СтрПоказаний.ТекстовоеСодержимое), Дата(Атрибутtime.Значение)-1, Ложь, ТЗ);
					КонецЦикла;
					ДобавитьСтрокуВТаблицуДанных(ТаблицаДанных, ВспомогательныеПараметры);
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
	КонецЦикла;
	
	Парсер.Закрыть();
	
	Возврат ТаблицаДанных;	 	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УпаковатьВоВременноеХранилище(ФайлДляЧтения, УникальныйИдентификатор)
	Файл 	= Новый ДвоичныеДанные(ФайлДляЧтения);
	Адрес 	= ПоместитьВоВременноеХранилище(Файл, УникальныйИдентификатор);
	
	Возврат Адрес;
КонецФункции

Функция ПолучитьТекстЗапросаЗагрузкаДанных()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаДанных.ПриборУчета КАК ПриборУчета,
	        |	ТаблицаДанных.Показания КАК Показания,
	        |	ТаблицаДанных.ПочасовыеДанные КАК ПочасовыеДанные,
	        |	ТаблицаДанных.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ТаблицаДанных.Дата КАК Дата
	        |ПОМЕСТИТЬ ЗагруженныеДанные
	        |ИЗ
	        |	&ТаблицаДанных КАК ТаблицаДанных
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗагруженныеДанные.Показания КАК Показания,
	        |	НАЧАЛОПЕРИОДА(ЗагруженныеДанные.Дата, ДЕНЬ) КАК День,
	        |	энргПриборыУчетаАбонента.Ссылка КАК ПриборУчета,
	        |	ЧАС(ЗагруженныеДанные.Дата) КАК Час,
	        |	ЗагруженныеДанные.ПриборУчета КАК ЗаводскойНомер,
	        |	ЗагруженныеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ЗагруженныеДанные.ПочасовыеДанные КАК ПочасовыеДанные
	        |ПОМЕСТИТЬ ПриборыУчета
	        |ИЗ
	        |	ЗагруженныеДанные КАК ЗагруженныеДанные
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	        |		ПО ЗагруженныеДанные.ПриборУчета = энргПриборыУчетаАбонента.Код
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПриборыУчета.День КАК День,
	        |	ПриборыУчета.ПриборУчета КАК ПриборУчета,
	        |	ПриборыУчета.Час КАК Час,
	        |	СУММА(ПриборыУчета.Показания) КАК Показания,
	        |	ПриборыУчета.ЗаводскойНомер КАК ЗаводскойНомер,
	        |	ПриборыУчета.ПочасовыеДанные КАК ПочасовыеДанные,
	        |	ПриборыУчета.ТарифнаяЗона КАК ТарифнаяЗона
	        |ПОМЕСТИТЬ ИтогПоЧасу
	        |ИЗ
	        |	ПриборыУчета КАК ПриборыУчета
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПриборыУчета.День,
	        |	ПриборыУчета.ПриборУчета,
	        |	ПриборыУчета.Час,
	        |	ПриборыУчета.ЗаводскойНомер,
	        |	ПриборыУчета.ПочасовыеДанные,
	        |	ПриборыУчета.ТарифнаяЗона
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.Организация КАК Организация,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.Район КАК Район,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета,
	        |	ИтогПоЧасу.День КАК День,
	        |	ИтогПоЧасу.Час КАК Час,
	        |	ИтогПоЧасу.Показания КАК Показания,
	        |	ИтогПоЧасу.ЗаводскойНомер КАК ЗаводскойНомер,
	        |	ИтогПоЧасу.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	ИтогПоЧасу.ПочасовыеДанные КАК ПочасовыеДанные
	        |ПОМЕСТИТЬ ДействующиеПУ
	        |ИЗ
	        |	ИтогПоЧасу КАК ИтогПоЧасу
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних КАК бестСостояниеПриборовУчетаНПСрезПоследних
	        |		ПО ИтогПоЧасу.ПриборУчета = бестСостояниеПриборовУчетаНПСрезПоследних.ПриборУчета
	        |ГДЕ
	        |	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДействующиеПУ.Организация КАК Организация,
	        |	ДействующиеПУ.Район КАК Район,
	        |	ДействующиеПУ.ОбъектРасчета КАК ОбъектРасчета,
	        |	ДействующиеПУ.ТочкаУчета КАК ТочкаУчета,
	        |	ДействующиеПУ.ПриборУчета КАК ПриборУчета,
	        |	ДействующиеПУ.День КАК День,
	        |	ДействующиеПУ.Час КАК Час,
	        |	ДействующиеПУ.Показания КАК Объем,
	        |	ДействующиеПУ.ЗаводскойНомер КАК ЗаводскойНомер,
	        |	ДействующиеПУ.ПочасовыеДанные КАК ПочасовыеДанные,
	        |	ДействующиеПУ.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	        |ПОМЕСТИТЬ Итог
	        |ИЗ
	        |	ДействующиеПУ КАК ДействующиеПУ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних КАК бестАктивностьТочекУчетаНПСрезПоследних
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних КАК бестУслугиТочекУчетаНПСрезПоследних
	        |			ПО бестАктивностьТочекУчетаНПСрезПоследних.Организация = бестУслугиТочекУчетаНПСрезПоследних.Организация
	        |				И бестАктивностьТочекУчетаНПСрезПоследних.Район = бестУслугиТочекУчетаНПСрезПоследних.Район
	        |				И бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета
	        |				И бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета = бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета
	        |		ПО ДействующиеПУ.Организация = бестАктивностьТочекУчетаНПСрезПоследних.Организация
	        |			И ДействующиеПУ.Район = бестАктивностьТочекУчетаНПСрезПоследних.Район
	        |			И ДействующиеПУ.ОбъектРасчета = бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета
	        |			И ДействующиеПУ.ТочкаУчета = бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета
	        |ГДЕ
	        |	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Итог.Организация КАК Организация,
	        |	Итог.Район КАК Район,
	        |	Итог.ОбъектРасчета КАК ОбъектРасчета,
	        |	Итог.ТочкаУчета КАК ТочкаУчета,
	        |	Итог.ПриборУчета КАК ПриборУчета,
	        |	Итог.День КАК День,
	        |	Итог.Час КАК Час,
	        |	Итог.Объем КАК Объем,
	        |	Итог.ЗаводскойНомер КАК ЗаводскойНомер,
	        |	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
	        |	Итог.ПочасовыеДанные КАК ПочасовыеДанные,
	        |	ИСТИНА КАК ГотовКОбработке,
	        |	Итог.Услуга КАК Услуга,
	        |	Итог.ПриборУчета КАК ПриборУчетаИзФайла
	        |ИЗ
	        |	Итог КАК Итог
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	NULL,
	        |	NULL,
	        |	NULL,
	        |	NULL,
	        |	ЗагруженныеДанные.ПриборУчета,
	        |	НАЧАЛОПЕРИОДА(ЗагруженныеДанные.Дата, ДЕНЬ),
	        |	ЧАС(ЗагруженныеДанные.Дата),
	        |	ЗагруженныеДанные.Показания,
	        |	NULL,
	        |	ЗагруженныеДанные.ТарифнаяЗона,
	        |	ЗагруженныеДанные.ПочасовыеДанные,
	        |	ЛОЖЬ,
	        |	NULL,
	        |	ЗагруженныеДанные.ПриборУчета
	        |ИЗ
	        |	ЗагруженныеДанные КАК ЗагруженныеДанные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Итог КАК Итог
	        |		ПО ЗагруженныеДанные.ПриборУчета = Итог.ПриборУчета
	        |ГДЕ
	        |	Итог.Организация ЕСТЬ NULL
	        |ИТОГИ
	        |	МАКСИМУМ(Организация),
	        |	МАКСИМУМ(Район),
	        |	МАКСИМУМ(ОбъектРасчета),
	        |	МАКСИМУМ(ТочкаУчета),
	        |	МАКСИМУМ(ЗаводскойНомер),
	        |	МАКСИМУМ(ГотовКОбработке)
	        |ПО
	        |	ПриборУчета,
	        |	ПочасовыеДанные
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка КАК УжеСозданныйДокумент
	        |ИЗ
	        |	Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
	        |ГДЕ
	        |	бестЗагруженныеДанныеИзВнешнихИсточников.ФайлДляЧтения = &ФайлДляЧтения";
	
	
КонецФункции

Процедура ДозаполнитьОтсутствующиеОбъемы(СтрЗагруженныеДанные, ДокЗагруженныеДанные, IDСтроки)
	Если ЗначениеЗаполнено(СтрЗагруженныеДанные.ПериодНачисления) Тогда
		День = СтрЗагруженныеДанные.ПериодНачисления;
		Пока День <= КонецМесяца(СтрЗагруженныеДанные.ПериодНачисления) Цикл 
			Час = 0;
			Пока Час <= 23 Цикл  
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("День", День);
				ПараметрыОтбора.Вставить("Час", Час);
				НайденныеСтроки = ДокЗагруженныеДанные.ПредоставленныеОбъемы.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() = 0 Тогда
					СтрПредоставленныеОбъемы = ДокЗагруженныеДанные.ПредоставленныеОбъемы.Добавить();
					СтрПредоставленныеОбъемы.День = День;   
					СтрПредоставленныеОбъемы.Час = Час;
					СтрПредоставленныеОбъемы.Объем = -1;
					СтрПредоставленныеОбъемы.IDСтроки = IDСтроки;
				КонецЕсли;
				Час = Час + 1;
			КонецЦикла;
			День = День + 86400;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуДанных(ТаблицаДанных,  ВспомогательныеПараметры)
	
	НСтрока = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НСтрока, ВспомогательныеПараметры);	
	
КонецПроцедуры

Функция НоваяТаблицаДесериализированныхДанных()
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ПриборУчета"		, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("Показания"		, ОбщегоНазначения.ОписаниеТипаЧисло(15, 6));
	Таблица.Колонки.Добавить("Дата"				, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("ПочасовыеДанные"	, Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ТарифнаяЗона"		, Новый ОписаниеТипов("СправочникСсылка.энргТарифныеЗоны"));
	Возврат Таблица;
КонецФункции

#КонецОбласти
